{
  "interests": [
    {
      "name": "Employment, office, trade, profession or vocation",
      "items": [
        {
          "member": "Consultant (solicitor) in DLA Piper UK LLP, 3 Noble Street, London EC2V 7EE",
          "partner": ""
        }
      ]
    },
    {
      "name": "Sponsorship",
      "items": []
    },
    {
      "name": "Contracts",
      "items": []
    },
    {
      "name": "Land",
      "items": [
        {
          "member": "Property at Shakespeare Tower, Barbican, London EC2",
          "partner": ""
        },
        {
          "member": "Car parking space, Defoe House, Barbican, London EC2",
          "partner": ""
        },
        {
          "member": "Storage space, Shakespeare Tower, Barbican, London EC2",
          "partner": ""
        }
      ]
    },
    {
      "name": "Licences",
      "items": []
    },
    {
      "name": "Corporate Tenancies",
      "items": [
        {
          "member": "Noble Street, London EC2 (DLA Piper)",
          "partner": ""
        },
        {
          "member": "London Wall, London EC2 (DLA Piper)",
          "partner": ""
        }
      ]
    },
    {
      "name": "Securities",
      "items": []
    },
    {
      "name": "Non-pecuniary interests",
      "items": [
        {
          "member": "Member of Law Society of England and Wales",
          "partner": ""
        },
        {
          "member": "Liveryman of Worshipful Company of Glovers of London",
          "partner": ""
        },
        {
          "member": "Liveryman of the Worshipful Company of Plaisterers",
          "partner": ""
        },
        {
          "member": "Liveryman of Solicitors Livery Company",
          "partner": ""
        },
        {
          "member": "Member of Methodist Church",
          "partner": ""
        },
        {
          "member": "Justice of the Peace, Central London Magistrates Court",
          "partner": ""
        },
        {
          "member": "Trustee of the Aldersgate Flame",
          "partner": ""
        },
        {
          "member": "Trustee of Van Mildert College Trust",
          "partner": ""
        },
        {
          "member": "Member/ Past President City Livery Club",
          "partner": ""
        },
        {
          "member": "Council Member Royal Society of St George",
          "partner": ""
        },
        {
          "member": "Patron and member of the Vintry and Dowgate Wards Club",
          "partner": ""
        },
        {
          "member": "Trustee of the Lord Mayor's 800th Anniversary Awards Trust",
          "partner": ""
        },
        {
          "member": "Director of Romney Tweed CIC",
          "partner": ""
        },
        {
          "member": "Governor of the Museum of London",
          "partner": ""
        },
        {
          "member": "Director of the Museum of London Archaeology Board",
          "partner": ""
        }
      ]
    }
  ],
  "gifts": [
    {
      "gift": "Upholders' Banquet at Carpenters' Hall.",
      "date": "9 April 2015"
    },
    {
      "gift": "Six tickets for Guildhall School of Music and Drama Gold medal concert at Barbican with drinks at interval and end.",
      "date": "13 May 2015"
    },
    {
      "gift": "Single invitation to evensong at Temple Church; reception at Middle Temple Hall and dinner at Inner Temple Hall as a combined invitation from the Treasurers of Inner and Middle Temple.",
      "date": "14 May 2015"
    },
    {
      "gift": "Seminar about Charitable Trustees' responsibilities at Cazenove - morning seminar with coffee and buffet lunch.",
      "date": "21 May 2015"
    },
    {
      "gift": "Magna Carta celebrations - morning of entertainment, picnic lunch at Runnymede Surrey County Council.",
      "date": "15 June 2015"
    },
    {
      "gift": "Innholders' Livery 500th anniversary banquet in Guildhall for 2 people",
      "date": "16 June 2015"
    },
    {
      "gift": "City of London Police Gala Awards dinner at Grange Hotel",
      "date": "19 June 2015"
    },
    {
      "gift": "Dinner in celebration of Eid. Invited by the Association of Muslim Police and the City of London Corporation.",
      "date": "31 July 2015"
    },
    {
      "gift": "Attended a Medieval Mumming followed by drinks reception - Skinners' Livery Company",
      "date": "14 September 2015"
    },
    {
      "gift": "Attended Prince's Trust afternoon tea at the Ritz (as Deputy Chairman of City Bridge Trust)",
      "date": "17 September 2015"
    },
    {
      "gift": "Invited by and attended London Symphony Orchestra concert at the Barbican with interval reception for 2 people",
      "date": "21 September 2015"
    },
    {
      "gift": "Invited by Sheriffs Alderman Charles Bowman and Christine Rigden to Sheriffs' breakfast at Drapers' Hall",
      "date": "28 September 2015"
    },
    {
      "gift": "Guest of the Hamburg Chamber of Commerce at dinner, lunch and dinner to celebrate historic links between City and Hamburg. This includes two nights' accommodation at Atlantic Kempinski Hotel.",
      "date": "14/15 October 2015"
    },
    {
      "gift": "Invited by and attended lunch with London Youth at Buckingham Palace (as Deputy Chairman of City Bridge Trust).",
      "date": "22 October 2015"
    },
    {
      "gift": "Dinner at Wax Chandlers' Hall hosted by Worshipful Company of Wheelwrights (speaking engagement)",
      "date": "13 November 2015"
    },
    {
      "gift": "Lunch at Two Temple Place hosted by Morgan Stanley",
      "date": "16 November 2015"
    },
    {
      "gift": "Prince's Trust Celebrate Success celebration at Milton Court",
      "date": "2 December 2015"
    },
    {
      "gift": "Barbican Centre two tickets to see Henry V at Barbican Theatre",
      "date": "4 December 2015"
    },
    {
      "gift": "Dinner with Turners' Livery Company",
      "date": "16 December 2015"
    },
    {
      "gift": "Dinner with the Management Consultants' Livery Company",
      "date": "20 January 2016"
    },
    {
      "gift": "Tacitus Lecture and reception as guest of the World Traders' Livery company",
      "date": "25 February 2016"
    },
    {
      "gift": "Dinner with Haberdashers at invite of Past Master Haberdasher",
      "date": "3 March 2016"
    },
    {
      "gift": "Presentation ceremony at London Palladium at invite of Prince's Trust",
      "date": "7 March 2016"
    },
    {
      "gift": "Dinner with Apothecaries at invite of Past Master Apothecary",
      "date": "17 March 2016"
    },
    {
      "gift": "Single invite to Woolmen's Livery Banquet at Ironmongers' Hall",
      "date": "23 May 2016"
    },
    {
      "gift": "Dinner to celebrate Eid in the City invite by Muslim Police Association",
      "date": "20 July 2016"
    },
    {
      "gift": "Dinner with the Hackney Carriage Drivers Livery Company",
      "date": "7 September 2016"
    },
    {
      "gift": "River trip with lunch on Lady Daphne in the River Sailing Barges Parade invite by Alderman and Mrs Michael Mainelli and Z/Yen",
      "date": "17 September 2016"
    },
    {
      "gift": "Guest of the Hamburg Chamber of Commerce Morgensprache Dinner, lunch and dinner with gifts of book and beer glass",
      "date": "12-14 October 2016"
    },
    {
      "gift": "Guest of Arts Scholars Livery Company to company lecture and reception",
      "date": "20 October 2016"
    },
    {
      "gift": "Guest of Christopher Moran, Co-operation Ireland to dinner at Crosby Hall",
      "date": "24 October 2016"
    },
    {
      "gift": "Reception given by First Aid Nursing Yeomanry at Lincoln's Inn",
      "date": "23 November 2016"
    },
    {
      "gift": "2 tickets to King Lear at the Barbican by the Barbican Centre",
      "date": "6 December 2016"
    },
    {
      "gift": "Fanmakers Livery Banquet at the Mansion House",
      "date": "8 December 2016"
    },
    {
      "gift": "Turners Livery Company dinner at Skinners' Hall",
      "date": "19 December 2016"
    },
    {
      "gift": "Dinner with Dyers' Livery Company",
      "date": "5 January 2017"
    },
    {
      "gift": "Dinner with the Information Technology Livery Company",
      "date": "18 January 2017"
    },
    {
      "gift": "Dinner at Goodenough College",
      "date": "8 March 2017"
    },
    {
      "gift": "Dinner with Cordwainers Livery Company at Clothworkers' Hall",
      "date": "10 March 2017"
    },
    {
      "gift": "Presentation and lunch with the Plumbers' Livery company",
      "date": "19 April 2017"
    }
  ]
}